# 固定値をまとめておきます

PUBLISHERS = ['岩波書店', '山川出版社', '藤原書店', '平凡社', '明石書店', '刀水書房', '中央公論新社',
                  'みすず書房',  'お茶の水書房', '原書房', '白水社', '河出書房新社', '彩流社', '勉誠出版',
                  '群像社', '恵雅堂', '水声社', '現代思潮新社', '成文社', '成文堂', '人文書院', '勁草書房',
                  '昭和堂', 'ミネルヴァ書房', '創文社', '教文館', '東洋書林', '柏書房', 'せりか書房',
                  '作品社', '丸善出版', '講談社学術文庫', 'ちくま新書',
                  '東京大学出版会', '京都大学学術出版会', '名古屋大学出版会', '東京外国語大学出版会', '北海道大学出版会',
                  '九州大学出版会',
                  '慶應義塾大学出版会', '早稲田大学出版部', '法政大学出版局', '関西学院出版会', '中央大学出版会',
                  '東洋大学出版会', '東海大学出版会']

ARTICLE_API = "http://ci.nii.ac.jp/opensearch/search?"

BOOK_API = "https://ci.nii.ac.jp/books/opensearch/search?"